Table of Contents
 Interface IMethodInvoker
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
public interface IMethodInvoker
Methods
 InvokeMethod<T>(string, Type, params object[])
Invokes remote method over Grpc via reflection.
T InvokeMethod<T>(string methodName, Type returnType, params object[] arguments)
Parameters
methodName string
Name of the method to invoke.
returnType Type
Type of the value which is return by the method
arguments object[]
Arguments with which the method will be called.
Returns
T
Type Parameters
T
Type to which the result will be converted.
 Edit this page